milloinviimeksi/app/controllers/events_controller.rb

SELECT * FROM "events" WHERE ("events"."user_id" = 1 AND "events"."id" = '1') LIMIT 1
---
  def show
    @event = Event.find_by_id_and_user_id(params[:id], current_user.id)

INSERT INTO "events" ("name", "created_at", "updated_at", "description") VALUES('adkjhglskj', '2010-04-15 08:29:50', '2010-04-15 08:29:50', 'slkdghaölskgjnasäfökbpi3jq09årj
---
  def create
    @event = Event.new(params[:event])
    @event.user = current_user

    if @event.save

SELECT * FROM "events" WHERE ("events"."user_id" = 1 AND "events"."id" = '1') LIMIT 1
DELETE FROM "events" WHERE "id" = 2
---
  def destroy
    @event = Event.find_by_id_and_user_id(params[:id], current_user.id)
    @event.destroy