milloinviimeksi/app/controllers/events_controller.rb

SELECT * FROM "events" WHERE ("events".user_id = 1) ORDER BY created_at
---
  def index
    @events = Event.all

SELECT * FROM "events" WHERE ("events"."id" = 1)
---
  def show
    @event = Event.find(params[:id])