milloinviimeksi/app/controllers/event_instances_controller.rb

SELECT * FROM "event_instances"
---
  def index
    @event_instances = EventInstance.all

SELECT * FROM "event_instances" WHERE ("event_instances"."id" = 1)
---
  def show
    @event_instance = EventInstance.find(params[:id])