milloinviimeksi/app/controllers/event_instances_controller.rb

SELECT * FROM "events" WHERE ("events"."id" IS NULL) LIMIT 1
INSERT INTO "event_instances" ("created_at", "event_id", "updated_at", "time") VALUES('2010-04-12 14:13:18', NULL, '2010-04-12 14:13:18', '2010-04-12 14:12:00')
---
  def create
    @event_instance = EventInstance.new(params[:event_instance])
    @event = Event.find_by_id params[:event_id]

    @event_instance.event = @event

    if @event_instance.save

SELECT * FROM "event_instances" WHERE ("event_instances"."id" = 17)
DELETE FROM "event_instances" WHERE "id" = 17
---
  def destroy
    @event_instance = EventInstance.find(params[:id])
    event = @event_instance.event
    @event_instance.destroy