milloinviimeksi/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "salt", "created_at", "updated_at", "hashed_password") VALUES('kisula', '12716745702173795040', '2010-04-19 10:56:10', '2010-04-19 10:56:10', '60ab69def4b7ed1c1c5b3db0c40731f893824de719de0d89910af7b41e5ca82e31da14a1b9e5c86276caa577a1842c9ce2d42151ec664e472411661a6b645f66')
---
  def create
    @user = User.new

    @user.name = params[:user][:name]
    @user.salt = Time.now
    @user.password = params[:user][:password]

    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 14)
---
  def show
    @user = User.find params[:id]